<?php
/**
* Language file for staff error/success messages
*
*/

return array(

    'staff_exists'              => 'Персонал уже существует!',
    'staff_not_found'           => 'Персонал с id [:id] не существует.',
    'insufficient_permissions' => 'Недостаточные права доступа.',
    'banned'              => 'заблокирован',
    'suspended'             => 'временно приостановлен',

    'success' => array(
        'create'    => 'Учетная запись персонал успешно создана.',
        'update'    => 'Учетная запись персонал успешно отредактирована.',
        'delete'    => 'Учетная запись персонал успешно удалена.',
        'ban'       => 'Учетная запись персонал успешно заблокирована.',
        'unban'     => 'Учетная запись персонал успешно разблокирована.',
        'suspend'   => 'Учетная запись персонал успешно приостановлена.',
        'unsuspend' => 'Учетная запись персонал успешно задействована.',
        'restored'  => 'Учетная запись персонал успешно востановлена.'
    ),

    'error' => array(
        'create'    => 'Возникли какие-то проблемы во время создания учетной записи персонал. Пожалуйста, повторите попытку позже.',
        'update'    => 'Возникли какие-то проблемы во время редактирования учетной записи персонал. Пожалуйста, повторите попытку позже.',
        'delete'    => 'Возникли какие-то проблемы во время удаления учетной записи персонал. Пожалуйста, повторите попытку позже.',
        'unsuspend' => 'Возникли какие-то проблемы во время разблокировки учетной записи персонал. Пожалуйста, повторите попытку позже.',
    ),

);
